Ha500/hunt_cyclic_noharmonic_cw0.1/0/fluid/B0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      B0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];

internalField   uniform (0 0 500);

boundaryField
{
    topWall
    {
        type            zeroGradient;
    }
    botWall
    {
        type            zeroGradient;
    }
    frontWall
    {
        type            zeroGradient;
    }
    backWall
    {
        type            zeroGradient;
    }
    inlet
    { 
        type           cyclic ;
    }
    outlet
    {
        type           cyclic ;
    }      
}

// ************************************************************************* //
