Ha500/hunt_cyclic_noharmonic_cw0.1/0/fluid/PotE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      PotE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    topWall
    {
       type            solidWallMixedPotentialCoupled;
       PotEnbr         PotE;
       sigma           sigma;
       value           uniform 0;        
    }
    botWall
    {
        type            solidWallMixedPotentialCoupled; 
        PotEnbr         PotE;
        sigma           sigma;
        value           uniform 0;
    }
    frontWall
    {
        type            zeroGradient;
    }
    backWall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            cyclic ;
    }
    outlet
    {
        type            cyclic ;
    }         
}


// ************************************************************************* //
