Ha500/hunt_cyclic_noharmonic_cw0.1/0/walls/sigma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      PotE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 -3 3 0 0 2 0];

internalField   uniform 0.167;

boundaryField
{
    floor
    {
       type          zeroGradient ;   
    }
    ceiling
    {
       type          zeroGradient ;   
    } 
    inletWalls
    {
        type          cyclic    ;
    }
    outletWalls
    {
        type          cyclic    ;
    }


    frontAndBack
    {
        type            zeroGradient;
    }

    topWall
    {
        type            zeroGradient;
    }

    botWall
    {
        type            zeroGradient;
    }

    leftAndRight
    {
        type            zeroGradient;
    }         
}


// ************************************************************************* //
