Ha500/hunt_cyclic_noharmonic_cw0.1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// libs
// (
//    "potentialFvPatchScalarField.so"
// );

application     cEpotFoam;  // mhdEpotMultiRegionFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.00001;

writeControl    clockTime;

writeInterval   21600;


purgeWrite      5;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           0.1;

maxDi           5.0;

adjustTimeStep  true;

functions
{
}


OptimisationSwitches
{
    fileHandler collated; // collated: thread buffer size for queued file writes.
    //  If set to 0 or not sufficient for the file size, threading is not used.
    //  Default: 1e9
    maxThreadFileBufferSize 1e11; // v1712 default is 0;
}

// ************************************************************************* //
