Ha500/hunt_cyclic_noharmonic_cw0.1/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0    -1 -1)
    (0.25 -1 -1)
    (0.25  1 -1)
    (0     1 -1)
    (0    -1 1)
    (0.25 -1 1)
    (0.25  1 1)
    (0     1 1)
);

blocks

(
    hex (0 1 2 3 4 5 6 7) (10 200 200)
    simpleGrading
    (1                      // x grading
    (                       // y grading
        (0.5 0.5 20)        // 50% of geometry, 50% of cells, expansion ratio 100
        (0.5 0.5 0.05)       // 50% of geometry, 50% of cells, expansion ratio 0.01
    )
    (                       // z grading
        (0.5 0.5 20)        // 50% of geometry, 50% of cells, expansion ratio 100
        (0.5 0.5 0.05)       // 50% of geometry, 50% of cells, expansion ratio 0.01
    ))
);

edges
(
);

boundary
(
    topWall
    {
        type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion    walls;
        samplePatch     botWall;
        faces
        (
            (4 5 6 7)
        );
    }
    
    botWall
    {
        type regionCouple;

        type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion    walls;
        samplePatch     topWall;
        faces
        (
            (0 1 2 3)
        );
    }
    
    inlet
    {
//        type patch;
        type            cyclic;
        neighbourPatch  outlet; 
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
//        type patch;
        type            cyclic;
        neighbourPatch  inlet;
        faces
        (
            (1 5 6 2)
        );
    }
    
     frontWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
     
     backWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
	    
);

mergePatchPairs
(
);


// ************************************************************************* //
