Ha500/hunt_cyclic_noharmonic_cw0.1/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        nCellsInCoarsestLevel 500;
        smoother         DICGaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance        1e-6;
        relTol           0;
    }

    U
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    UFinal
    {
        $U;
        tolerance        1e-7;
        relTol           0;
    }
    
    PotE
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        nCellsInCoarsestLevel 500;
        smoother         DICGaussSeidel;
    }
    
    PotEFinal
    {
        $PotE;
        tolerance        1e-6;
        relTol           0;  
    }    
}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    pRefCell 1001;
    pRefValue 0;

    residualControl
    {
        p
        {
            relTol  0;
            // if this tolerance is reached, leave
            tolerance 1e-04;
        }
        U
        {
            relTol  0;
            // if this tolerance is reached, leave
            tolerance 1e-04;

        }

    }
}

PotE
{
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    PotERefCell        0;
    PotERefValue       0;
}
// ************************************************************************* //
