Ha500/hunt_cyclic_noharmonic_cw0.1/system/walls/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0    -1 -1.5)
    (0.25 -1 -1.5)
    (0.25  1 -1.5)
    (0     1 -1.5)
    (0    -1 -1)
    (0.25 -1 -1)
    (0.25  1 -1)
    (0     1 -1)
    (0    -1 1)
    (0.25 -1 1)
    (0.25  1 1)
    (0     1 1)
    (0    -1 1.5)
    (0.25 -1 1.5)
    (0.25  1 1.5)
    (0     1 1.5)
);

blocks

(
    hex (0 1 2 3 4 5 6 7) (10 200 50)
    simpleGrading 
    (1
    (                
        (0.5 0.5 20)
        (0.5 0.5 0.05)
    )
    0.05)    
    hex (8 9 10 11 12 13 14 15) (10 200 50)
    simpleGrading
    (1  
    (                
        (0.5 0.5 20)
        (0.5 0.5 0.05)
    )
    20)    
);
edges
(
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    ceiling
    {
        type wall;
        faces
        (
            (12 13 14 15)
        );
    }

    outletWalls
    {
        type cyclic;
        neighbourPatch  inletWalls;
        faces
        (
            (2 6 5 1)
            (9 13 14 10)
        );
    }

    inletWalls
    {
        type cyclic;
        neighbourPatch  outletWalls;
        faces
        (
            (0 4 7 3)
            (8 12 15 11)
        );
    }

    topWall
    {
        type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     botWall;
        faces
        (
            (4 5 6 7)
        );
    }

    botWall
    {
        type            mappedWall;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     topWall;
        faces
        (
            (8 9 10 11)
        );
    }

    leftAndRight
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (11 15 14 10)
            (8 12 13 9)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
